# 算术运算符

# + 加法运算符
print(1 + 2)
# 加法运算符的重载
print('1' + '2')
# 重载：赋予新的功能
print([1, 2] + [3, 4])

# - 减法运算符
print(4 - 12)

# * 乘法运算符
print(2 * 3)

# ** 幂运算符
print(3 * 3 * 3 * 3)
print(3 ** 4)

# / 除法运算符
print(5 / 2)  # 结果是浮点数
# ZeroDivisionError 除零错误

# // 地板除运算符（jpch89：向下取整运算符）
print(5 // 2)
print(5.2 // 2)  # 2.0
print(-5.2 // 2)  # -3.0

# % 求模运算符（求余运算符）
print(5 % 2)
print(10 % 4)

# = 赋值运算符
a = 10
a, b, c = 10, 20, 30
# 链式赋值
a = b = c = 3

# 注意：
# 除零问题
# 优先级和小括号()的使用

# 整除和求余的应用场景
# 求行和列
# 一共10个数，从0开始，排成4行4列
num = 6
row = num // 4  # 第2行
col = num % 4  # 第2列
